aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/radio_control.c
/*
 * File:   radio_control.c
 * Author: ICE_MEGANE
 * ラジコン用リモコン処理全般
 * Created on 2020/03/5, 22:26
 */

#include <xc.h>
#include "./mcufunc/pic18f25q10.h"
#include "userdefine.h"


#include "./mcufunc/gpio.h"
#include "./mcufunc/mcu_setup.h"
#include "./mcufunc/timer_driver.h"
#include "./radio_control.h"


/* ポート設定 */
#define RC_IOC_BITPOS_CH_THROTTLE              ((u8)0)        /* 0：RC_DUTY_CH_THROTTLE           */
#define RC_IOC_BITPOS_CH_SHIFT_MODE            ((u8)3)        /* 1：RC_DUTY_CH_SHIFT_MODE         */
#define RC_IOC_BITPOS_CH_RESPONSE              ((u8)2)        /* 2：RC_DUTY_CH_RESPONSE           */
#define RC_IOC_BITPOS_CH_PADDLE_SHIFT_INPUT    ((u8)1)        /* 3：RC_DUTY_CH_PADDLE_SHIFT_INPUT */
#define RC_IOC_BITPOS_CH_REV_LIMIT             ((u8)4)        /* 4：RC_DUTY_CH_REV_LIMIT          */

/* 設定関連 */
#define RC_DUTY_PULSE_ON_LOGIC                 LOW            /* 入力パルスのアクティブロジック */       /* ※IOCAF、IOCANの設定と合わせること */
#define RC_DUTY_JUDGE_TIMEOUT_CNT              ((u8)5)
#define RC_DUTY_CONVERSION_ROUND               ((u16)100)     /* dutyの端点丸め数値 */
#define RC_DUTY_0P_CNT                         ((u16)2000)    /* duty0%相当のカウント現在値 */
#define RC_DUTY_100P_CNT                       ((u16)4000)    /* duty100%相当のカウント現在値　 */
#define RC_DUTY_100P_CNT_DIFF                  ( RC_DUTY_100P_CNT - RC_DUTY_0P_CNT )     /* duty100%相当のタイマカウント差分 */

/* duty増減方向の設定(リモコンの操作反転したい場合に使う) */
#define RC_DUTY_PROP                         ((u8)0)       /* 比例 */
#define RC_DUTY_REVERSE_PROP                 ((u8)1)       /* 反比例 */


u8 u8_rc_s_debug_flag;

u8 u8_rc_g_duty_judge_sequence;                    /* パルス幅測定シーケンス */

u16 u16_rc_g_duty_speed;                             /* 前進/後進 速度入力 */
u16 u16_rc_g_duty_shift_mode;                        /* シフトチェンジモード入力 (セミオートマ/オート) */
u16 u16_rc_g_duty_speed_gain;                        /* 加速度合い(エンジン応答)入力 */
u16 u16_rc_g_duty_shift_updown;                      /* シフトアップダウン入力 */
u16 u16_rc_g_duty_rev_limit;                         /* レブリミット閾値入力 */

static u8 u8_rc_s_duty_judge_timeout_flag;         /* パルス幅取得 タイムアウト */
static u8 u8_rc_s_duty_judge_timeout_cnt;          /* パルス幅取得 失敗カウント */
static u8 u8_rc_s_duty_get_complete;               /* 1msタスクでのduty取得完了フラグ */        /* タイミング的にループと割り込みで同時書き込みすることはないはず。 */

static u8 u8_rc_s_duty_cnt_debug;


/* 割り込みで取得する値保存用の構造体 */
typedef struct rc_duty_sample_str
{
    u8 u8_start_capture_complete_flag;    /* 指定のチャネルのタイマカウント取得完了フラグ(ON開始時) */
    u8 u8_end_capture_complete_flag;      /* 指定のチャネルのタイマカウント取得完了フラグ(ON終了時) */
    u16 u16_ch_duty_cnt_start;            /* duty  ON開始時のタイマカウント ( タイマレジスタからの取得値 ) */
    u16 u16_ch_duty_cnt_end;              /* duty OFF開始時のタイマカウント ( タイマレジスタからの取得値 ) */
}rc_duty_sample_data;

static rc_duty_sample_data rc_duty_get_by_int_tbl[ RC_DUTY_CH_IDX_MAX ] =
{
    { CLEAR,    CLEAR,    (u16)0,    (u16)0 },
    { CLEAR,    CLEAR,    (u16)0,    (u16)0 },
    { CLEAR,    CLEAR,    (u16)0,    (u16)0 },
    { CLEAR,    CLEAR,    (u16)0,    (u16)0 },
    { CLEAR,    CLEAR,    (u16)0,    (u16)0 },
};

/* ループタスクで使用するduty比保存テーブル (0~100) ※外部の処理でも使う */
u8 u8_rc_g_ch_duty_tbl[ RC_DUTY_CH_IDX_MAX ] =
{
    (u8)0,
    (u8)0,
    (u8)0,
    (u8)0,
    (u8)0
};

/*===================================================================================================================================*/
/*===================================================================================================================================*/
/* レジスタ設定 */
/* SFRからの読み止しだけは、メモリからの毎回呼び出しを指定する */
typedef struct rc_duty_sample_register_setting
{   /* レジスタ設定 */
    volatile u8 *port_addr;               /* IOCポートレジスタへのポインタ ※指している先をvolatileとして扱う */
    u8 port_bitmask;                      /* IOCポートレジスタのビット指定 */
    volatile u8 *flag_addr;               /* IOCフラグレジスタへのポインタ(アドレス指定しておく) */
    u8 flag_bitmask;                      /* IOCフラグレジスタのビット指定 */
    u8 duty_direction;                    /* プロポのレバーに対するduty増減方向 */
}rc_duty_sample_setting;


/* ここで全チャネルまとめて指定できるようにしておきたい */
static const rc_duty_sample_setting rc_duty_get_register_combi_tbl[ RC_DUTY_CH_IDX_MAX ] =
{ /* IOCポート,  IOCポート-ビット位置,  IOCフラグ,  IOCフラグ-ビット位置,    dutyの増減方向    */
    { &PORTA,    (u8)(1U << RC_IOC_BITPOS_CH_THROTTLE),               &IOCAF,      (u8)(1U << RC_IOC_BITPOS_CH_THROTTLE),                RC_DUTY_REVERSE_PROP },      /* RC_DUTY_CH_THROTTLE           */
    { &PORTA,    (u8)(1U << RC_IOC_BITPOS_CH_SHIFT_MODE),             &IOCAF,      (u8)(1U << RC_IOC_BITPOS_CH_SHIFT_MODE),              RC_DUTY_PROP         },      /* RC_DUTY_CH_SHIFT_MODE         */
    { &PORTA,    (u8)(1U << RC_IOC_BITPOS_CH_RESPONSE),               &IOCAF,      (u8)(1U << RC_IOC_BITPOS_CH_RESPONSE),                RC_DUTY_PROP         },      /* RC_DUTY_CH_RESPONSE           */
    { &PORTA,    (u8)(1U << RC_IOC_BITPOS_CH_PADDLE_SHIFT_INPUT),     &IOCAF,      (u8)(1U << RC_IOC_BITPOS_CH_PADDLE_SHIFT_INPUT),      RC_DUTY_PROP         },      /* RC_DUTY_CH_PADDLE_SHIFT_INPUT */
    { &PORTA,    (u8)(1U << RC_IOC_BITPOS_CH_REV_LIMIT),              &IOCAF,      (u8)(1U << RC_IOC_BITPOS_CH_REV_LIMIT),               RC_DUTY_PROP         },      /* RC_DUTY_CH_REV_LIMIT          */
};
/*===================================================================================================================================*/
/*===================================================================================================================================*/


/* 関数プロトタイプ宣言 */
static void func_rc_s_convert_tmrcount_to_duty( void );
static void func_rc_s_debug_pulseout( void );
static void func_rc_s_ioc_flag_erase( u8 u8_ioc_ch );
static void func_rc_s_ioc_state_read_back( u8 *u8_flag_buff, u8 *u8_port_buff ,u8 u8_ioc_ch );


/* グローバル変数 */
/**************************************************************/
/*  Function:                                                 */
/*  変数初期設定                                               */
/*                                                            */
/**************************************************************/
void func_rc_g_init( void )
{
    u8 u8_loopcnt;
    
    u8_rc_s_duty_judge_timeout_flag = CLEAR;
    u8_rc_s_duty_judge_timeout_cnt = (u8)0;
    u8_rc_g_duty_judge_sequence = RC_SEQ_DUTY_SAMPLING_WAIT;
    
    u16_rc_g_duty_speed          = (u16)0;
    u16_rc_g_duty_shift_mode     = (u16)0;
    u16_rc_g_duty_speed_gain     = (u16)0;
    u16_rc_g_duty_shift_updown   = (u16)0;
    u16_rc_g_duty_rev_limit      = (u16)0;
    
    u8_rc_s_debug_flag = CLEAR;
    u8_rc_s_duty_get_complete = CLEAR;
    u8_rc_s_duty_cnt_debug = (u8)0;
}



/**************************************************************/
/*  Function:                                                 */
/*  main関数                                                   */
/*                                                            */
/*                                                            */
/**************************************************************/
void func_rc_g_main( void )
{
    /* @@割り込み関数で更新される変数を、この処理内で再更新しないこと */
    func_rc_s_convert_tmrcount_to_duty();       /* タイマカウントからdutyへの変換 */
    func_rc_s_debug_pulseout();                 /* パルス幅取得の動作確認処理 */
}


/**************************************************************/
/*  Function:                                                 */
/*  入力パルスのduty識別・決定関数                              */
/*                                                            */
/*  ほんとはMCUハードウェア機能だけで完結させたいが、タイマ数が足りないのでパワー実装 */
/* @@多少判定処理のクロック誤差が生まれると思うが、実測で誤差として流せるか確認して判断したい */
/* ポート指定を容易に行えるように&同一タイミングのパルスはなるべく同じタイマ値を取得したいので、この処理内で判別する */
/**************************************************************/
void func_rc_g_duty_detection( void )
{   
    u8 u8_loopcnt;
    u16 u16_timer_register_buff;
    u8 u8_ch_sample_not_complete_flag;
    
    u8 u8_ioc_flag_buff;
    u8 u8_ioc_port_buff;
    
    /* ローカル変数初期化 */
    u8_ioc_flag_buff = (u8)0;
    u8_ioc_port_buff = (u8)0;
    u8_loopcnt = (u8)0;
    u16_timer_register_buff = (u16)0;
    u8_ch_sample_not_complete_flag = CLEAR;
    
    
