aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/radio_control.c
    switch ( u8_rc_g_duty_judge_sequence )
    {
        case RC_SEQ_DUTY_SAMPLING_WAIT:
            /* 初回のトリガ操作を待機中・・・ */
            /* いずれかのチャネルでIOC割り込みが発生した場合にタイマスタート */
            /* 最初のチャネルだけdutyが小さくならないよう、タイミング優先でまずはタイマスタート */
            func_mset_g_timer5_couter_set( (u16)1 );            /* タイマ レジスタクリア ※オーバーフロー割り込み仕様するので、リセット時に割り込みはいらないよう１をセットする */
            func_mset_g_timer5_onoff( ON );                     /* タイマ カウントスタート */

#if 0
            for( u8_loopcnt = (u8)0; u8_loopcnt < RC_DUTY_CH_IDX_MAX ; u8_loopcnt++ )
            {
                func_rc_s_ioc_state_read_back( &u8_ioc_flag_buff, &u8_ioc_port_buff ,u8_loopcnt );

                if( ( u8_ioc_flag_buff == SET ) &&
                    ( u8_ioc_port_buff == RC_DUTY_PULSE_ON_LOGIC ) )
                { /* いずれかのチャネルで、ON区間開始を検知：連続測定開始 */
                    u8_rc_g_duty_judge_sequence = RC_SEQ_DUTY_SAMPLING;
                    u8_rc_s_duty_get_complete = CLEAR;                          /* メインループ側でのタイマ値取得完了フラグ クリア */
                }
                else
                { /* ON区間終了を検知 */
                    /* 初回がON区間終了から始めるのはおかしいので、タイマ停止。シーケンスそのまま */
                    func_mset_g_timer5_couter_set( (u16)1 );            /* タイマ レジスタクリア ※オーバーフロー割り込み仕様するので、リセット時に割り込みはいらないよう１をセットする */
                    func_mset_g_timer5_onoff( OFF );                     /* タイマ カウント停止 */
                    rc_duty_get_by_int_tbl[u8_loopcnt].u16_ch_duty_cnt_start = (u16)0;
                    rc_duty_get_by_int_tbl[u8_loopcnt].u16_ch_duty_cnt_end = (u16)0;
                    rc_duty_get_by_int_tbl[u8_loopcnt].u8_start_capture_complete_flag = CLEAR;
                    rc_duty_get_by_int_tbl[u8_loopcnt].u8_end_capture_complete_flag = CLEAR;
                }

                func_rc_s_ioc_flag_erase( u8_loopcnt );             /* IOCフラグクリア */
            }
#else
                /* 最後のチャネルのサンプル終了後、次にCH0のIOC割り込みが入るまで若干猶予がある。 */
                /* このタイミングでループタスクで値回収したいので、開始はCH0に固定する */
                u8_loopcnt = RC_DUTY_CH_THROTTLE;
                func_rc_s_ioc_state_read_back( &u8_ioc_flag_buff, &u8_ioc_port_buff ,u8_loopcnt );

                if( ( u8_ioc_flag_buff == SET ) &&
                    ( u8_ioc_port_buff == RC_DUTY_PULSE_ON_LOGIC ) )
                { /* いずれかのチャネルで、ON区間開始を検知：連続測定開始 */
                    u8_rc_g_duty_judge_sequence = RC_SEQ_DUTY_SAMPLING;
                    u8_rc_s_duty_get_complete = CLEAR;                          /* メインループ側でのタイマ値取得完了フラグ クリア */
                }
                else
                { /* ON区間終了を検知 */
                    /* 初回がON区間終了から始めるのはおかしいので、タイマ停止。シーケンスそのまま */
                    func_mset_g_timer5_onoff( OFF );                     /* タイマ カウント停止 */
                    func_mset_g_timer5_couter_set( (u16)1 );            /* タイマ レジスタクリア ※オーバーフロー割り込み仕様するので、リセット時に割り込みはいらないよう１をセットする */
                    rc_duty_get_by_int_tbl[u8_loopcnt].u16_ch_duty_cnt_start = (u16)0;
                    rc_duty_get_by_int_tbl[u8_loopcnt].u16_ch_duty_cnt_end = (u16)0;
                    rc_duty_get_by_int_tbl[u8_loopcnt].u8_start_capture_complete_flag = CLEAR;
                    rc_duty_get_by_int_tbl[u8_loopcnt].u8_end_capture_complete_flag = CLEAR;
                }

                for( u8_loopcnt = (u8)0; u8_loopcnt < RC_DUTY_CH_IDX_MAX ; u8_loopcnt++ )
                { /* フラグは全部クリアする */
                    func_rc_s_ioc_flag_erase( u8_loopcnt );             /* IOCフラグクリア */
                }          
            
#endif

            break;
            
        case RC_SEQ_DUTY_SAMPLING:
            u16_timer_register_buff = func_mset_g_timer5_read();        /* 割り込みが来た時点でいったんタイマレジスタの値を保持しておく */
            
            /* 順番にチャネル判定 */
#if 0
            /* 1チャンネルでの動作確認用 */
            func_rc_s_ioc_state_read_back( &u8_ioc_flag_buff, &u8_ioc_port_buff ,RC_DUTY_CH_REV_LIMIT );

            if( u8_ioc_flag_buff == SET )
            {
                if( u8_rc_s_debug_flag == SET )
                {
                    u8_rc_s_debug_flag = CLEAR;
                }
                else
                {
                    u8_rc_s_debug_flag = SET;
                }
                
                GPIO_OUT_DEBUG = u8_rc_s_debug_flag;    
            }


            for( u8_loopcnt = (u8)0; u8_loopcnt < RC_DUTY_CH_IDX_MAX ; u8_loopcnt++ )
            { /* フラグは全部クリアする */
                func_rc_s_ioc_flag_erase( u8_loopcnt );             /* IOCフラグクリア */
            }  

#else
            /* IOC割り込みフラグが立ってるポートを確認 */
            for( u8_loopcnt = (u8)0; u8_loopcnt < RC_DUTY_CH_IDX_MAX ; u8_loopcnt++ )
            {
                func_rc_s_ioc_state_read_back( &u8_ioc_flag_buff, &u8_ioc_port_buff ,u8_loopcnt );
            
                if( u8_ioc_flag_buff == SET )
                { /* IOC割り込み発生あり */
                    if( u8_ioc_port_buff != RC_DUTY_PULSE_ON_LOGIC )
                    { /* ON区間終わりの時 */
                        rc_duty_get_by_int_tbl[u8_loopcnt].u16_ch_duty_cnt_end = u16_timer_register_buff;        /* IOC割り込み発生時点でのタイマ値を取得 ※PWM仕様上、複数チャネルが同時に切り替わることはないはず。 */
                        rc_duty_get_by_int_tbl[u8_loopcnt].u8_end_capture_complete_flag = SET;                   /* 対象のチャネルのパルス幅測定 完了 */
                    }
                    else
                    { /* ON区間始まりの時：開始キャプチャとして保存する ※基本連続しているので、1つ後のチャネルでここに来る */
                        rc_duty_get_by_int_tbl[u8_loopcnt].u16_ch_duty_cnt_start = u16_timer_register_buff;      /* IOC割り込み発生時点でのタイマ値を取得 ※PWM仕様上、複数チャネルが同時に切り替わることはないはず。 */
                        rc_duty_get_by_int_tbl[u8_loopcnt].u8_start_capture_complete_flag = SET;                 /* 対象のチャネルのパルス幅測定 完了 */
                    }

                    func_rc_s_ioc_flag_erase( u8_loopcnt );             /* IOCフラグクリア */
                }

                if( rc_duty_get_by_int_tbl[u8_loopcnt].u8_end_capture_complete_flag == CLEAR )
                { /* まだON区間測定が終了してないチャネルがある */
                    u8_ch_sample_not_complete_flag = SET;
                }
            }

            
            /* 全チャネル パルス幅測定 完了判定 */
            if( u8_ch_sample_not_complete_flag != SET )
            { /* 全チャネルサンプリング完了 */
                u8_rc_g_duty_judge_sequence = RC_SEQ_DUTY_SAMPLING_WAIT;            /* 待機状態へ戻す　※待機状態中にループタスクで値回収 */
                func_mset_g_timer5_onoff( OFF );
                func_mset_g_timer5_couter_set( (u16)1 );

