aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/radio_control.c
                for( u8_loopcnt = (u8)0; u8_loopcnt < RC_DUTY_CH_IDX_MAX ; u8_loopcnt++ )
                { /* ループが2回連続で走るが、すでに全CHサンプル完了後なのでOK */
                    rc_duty_get_by_int_tbl[u8_loopcnt].u8_start_capture_complete_flag = CLEAR;
                    rc_duty_get_by_int_tbl[u8_loopcnt].u8_end_capture_complete_flag = CLEAR;
                }
            }
#endif

            break;
            
        case RC_SEQ_DUTY_SAMPLING_TIMEOUT:
            /* タイムアウト発生 */
            /* CH0のIOC割り込み発生後、8CHすべて取得できる時間以上経過したのにパルスが来なかった後、IOC割り込み発生するとここに来る */
            /* パルス幅の取得タイミングがずれたときにCH0開始に戻すために設けた */
            /* 完全にパルスが止まった場合はIOC割り込みがなく、ここに来ることができないので、ループタスク側でもタイムアウト処理を作ったほうが良いかも */
            if( u8_rc_s_duty_judge_timeout_cnt < U8_MAX )
            {
                u8_rc_s_duty_judge_timeout_cnt++;
            }
            
            if( u8_rc_s_duty_judge_timeout_cnt > RC_DUTY_JUDGE_TIMEOUT_CNT )
            { /* 何度もタイムアウトが発生している */
                u8_rc_g_duty_judge_sequence = RC_SEQ_DUTY_SAMPLING_FAILE;
            }
            else
            {
                u8_rc_g_duty_judge_sequence = RC_SEQ_DUTY_SAMPLING_WAIT;
            }

            func_mset_g_timer5_onoff( OFF );                    /* タイマ カウント停止 */
            func_mset_g_timer5_couter_set( (u16)1 );            /* タイマ レジスタクリア ※オーバーフロー割り込み仕様するので、リセット時に割り込みはいらないよう１をセットする */
            
            for( u8_loopcnt = (u8)0; u8_loopcnt < RC_DUTY_CH_IDX_MAX ; u8_loopcnt++ )
            { /* フラグは全部クリアする */
                func_rc_s_ioc_flag_erase( u8_loopcnt );             /* IOCフラグクリア */
            }
        
            break;
            
        case RC_SEQ_DUTY_SAMPLING_FAILE:
            /* パルス幅測定失敗 */
            /* ここに来た時点で設計ミスなので、デバッグ時点ではあえて抜けるないようにしておく。 */
            for( u8_loopcnt = (u8)0; u8_loopcnt < RC_DUTY_CH_IDX_MAX ; u8_loopcnt++ )
            {
                // *(rc_duty_get_register_combi_tbl[u8_loopcnt].port_addr) != (u8)0;                     /* 読み取り専用なので特に意味なし */
                func_rc_s_ioc_flag_erase( u8_loopcnt );                                                  /* IOCフラグクリア */
                rc_duty_get_by_int_tbl[u8_loopcnt].u16_ch_duty_cnt_start = (u16)0;
                rc_duty_get_by_int_tbl[u8_loopcnt].u16_ch_duty_cnt_end = (u16)0;
                rc_duty_get_by_int_tbl[u8_loopcnt].u8_start_capture_complete_flag = CLEAR;
                rc_duty_get_by_int_tbl[u8_loopcnt].u8_end_capture_complete_flag = CLEAR;
            }
              
            u8_rc_s_duty_judge_timeout_cnt = (u8)0;
            
            /* @@何度もここに来るので、ここに関数記述するのは微妙かもしれない。実害ないのでいったん保留。 */
            func_mset_g_timer5_onoff( OFF );                    /* タイマ カウント停止 */
            func_mset_g_timer5_couter_set( (u16)1 );            /* タイマ レジスタクリア ※オーバーフロー割り込み仕様するので、リセット時に割り込みはいらないよう１をセットする */
        
            break;
        
        default:
            break;
    }
}

/**************************************************************/
/*  Function:                                                 */
/*  入力パルスのduty識別・決定関数                              */
/*  IOC割り込みがあったのにパルス幅取得を完了できなかった場合の処理 */
/**************************************************************/
void func_rc_g_duty_detect_timeout( void )
{
    //u8_rc_s_duty_judge_timeout_flag = SET;
}


/**************************************************************/
/*  Function:                                                 */
/* *u8_flagbuff：引数/変数 IOCフラグ状態                          */
/* *u8_portbuff：引数/変数 IOC割り当てのポート状態                */
/* u8_ioc_ch：引数 IOCのチャネル指定                             */
/**************************************************************/
static void func_rc_s_ioc_state_read_back( u8 *u8_flag_buff, u8 *u8_port_buff ,u8 u8_ioc_ch )
{
    u8 u8_iocxf_flag;
    u8 u8_iocxf_port_state;

    u8_iocxf_flag = *(rc_duty_get_register_combi_tbl[ u8_ioc_ch ].flag_addr);                             /* IOCフラグレジスタの値を取得 */
    u8_iocxf_flag = u8_iocxf_flag & (rc_duty_get_register_combi_tbl[ u8_ioc_ch ].flag_bitmask);        /* ビットマスク */
    
    if( u8_iocxf_flag != (u8)0 )
    { /* IOCフラグレジスタの該当ビットが0ではない */
        *u8_flag_buff = SET;         /* のちの処理でビット位置気にしないよう、この時点で上書きする */
    }
    else
    {
        *u8_flag_buff = CLEAR;
    }
    
    /* IOCポートの確認 */
    u8_iocxf_port_state = *(rc_duty_get_register_combi_tbl[ u8_ioc_ch ].port_addr);                       /* IOCに該当のポート状態を取得 */
    u8_iocxf_port_state = u8_iocxf_port_state & (rc_duty_get_register_combi_tbl[ u8_ioc_ch ].port_bitmask);     /* ビットマスク */
    
    if( u8_iocxf_port_state != (u8)0 )
    {
        *u8_port_buff = SET;
    }
    else
    {
        *u8_port_buff = CLEAR;
    }
}

/**************************************************************/
/*  Function:                                                 */
/* IOC割り込みの特定のビットをクリアする                          */
/**************************************************************/
static void func_rc_s_ioc_flag_erase( u8 u8_ioc_ch )
{
    u8 u8_ioc_flag_buff;
    
    u8_ioc_flag_buff = rc_duty_get_register_combi_tbl[ u8_ioc_ch ].flag_bitmask;
    u8_ioc_flag_buff = (u8)~u8_ioc_flag_buff;       /* ビット反転 */
    
    *( rc_duty_get_register_combi_tbl[ u8_ioc_ch ].flag_addr ) &= u8_ioc_flag_buff;
}



/**************************************************************/
/*  Function:                                                 */
/*  入力パルス幅の一時保存値を回収                              */
/*  タイマの計算値を0~100の1byte内のdutyへ変換する              */
/*  インバータ電圧、角度ともに100段程度分解能があれば困らないはず  */
/*  @@除算が激重でこの処理が一番処理負荷高いので、処理時間問題ないかチェックする */
/**************************************************************/
static void func_rc_s_convert_tmrcount_to_duty( void )
{
    u8 u8_loopcnt;
    u8 u8_duty_calc_disable_flag;
    u16 u16_pulse_on_time_cnt_buff;
    u16 u16_calc_buff;
    u16 u16_calc_buff2;
    u32 u32_calc_buff;
    u16 u16_tmr_cnt_base;
    u16 u16_tmr_cnt_gap;
    

    /* ローカル変数初期化 */
    u8_loopcnt = (u8)0;
    u16_pulse_on_time_cnt_buff = (u16)0;
    u16_calc_buff = (u16)0;
    u16_calc_buff2 = (u16)0;
    u8_duty_calc_disable_flag = CLEAR;
    
    /* グローバル変数へ移植 */
    /* 割り込み更新がないタイミングでデータを取り出す */
    if( ( u8_rc_s_duty_get_complete == CLEAR ) &&
        ( u8_rc_g_duty_judge_sequence == RC_SEQ_DUTY_SAMPLING_WAIT ) )
    { /* 次のパルス開始タイミングまで待機中 (duty更新なし中) */
        /* 基準カウント数の算出 */
        u16_tmr_cnt_base = RC_DUTY_100P_CNT - RC_DUTY_0P_CNT;

        for( u8_loopcnt = (u8)0; u8_loopcnt < RC_DUTY_CH_IDX_MAX; u8_loopcnt++ )
        {
            u16_calc_buff = rc_duty_get_by_int_tbl[ u8_loopcnt ].u16_ch_duty_cnt_start;         /* パルスON開始時のタイマ・カウント */
            u16_calc_buff2 = rc_duty_get_by_int_tbl[ u8_loopcnt ].u16_ch_duty_cnt_end;          /* パルスON終了時のタイマ・カウント */

            if( u16_calc_buff < u16_calc_buff2 )
            { /* 正常：後ろのタイミングのタイマカウントのほうが大きい */
                u16_calc_buff = u16_calc_buff2 - u16_calc_buff;

