aisumegane/MPLAB_projects_PIC18F25Q10_MRC_program/PIC18F25Q10_MRC_program.X/source/radio_control.c
                /* 上下限クリップ処理 */
                if( u16_calc_buff >= RC_DUTY_0P_CNT )
                {
                    u16_tmr_cnt_gap = u16_calc_buff - RC_DUTY_0P_CNT;

                    if( u16_tmr_cnt_gap < RC_DUTY_CONVERSION_ROUND)
                    { /* ほぼ0% */
                        u16_tmr_cnt_gap = (u16)0;                       /* 0%に丸め込む */
                    }

                    if( u16_tmr_cnt_gap > u16_tmr_cnt_base )
                    { /* 100%より大きい */
                        u16_tmr_cnt_gap = u16_tmr_cnt_base;
                    }
                    else
                    {
                        u16_calc_buff = u16_tmr_cnt_base - u16_tmr_cnt_gap;
                        if( u16_calc_buff < RC_DUTY_CONVERSION_ROUND )
                        { /* ほぼ100%のパルス幅になっている */
                            u16_tmr_cnt_gap = u16_tmr_cnt_base;         /* 100%に丸め込む */
                        }
                    }
                }
                else
                {
                    u16_tmr_cnt_gap = (u16)0;
                }
            }
            else
            { /* ラジコンのPWMの性質上、パルス幅がゼロになることはない */
                u8_duty_calc_disable_flag = SET;            /* 異常時：計算しない*/
            }


           
            if( u8_duty_calc_disable_flag == CLEAR )
            { /* duty計算許可がある */
                if( rc_duty_get_register_combi_tbl[ u8_loopcnt ].duty_direction == RC_DUTY_REVERSE_PROP )
                { /* duty増減方向を反転させる場合 */
                    u16_tmr_cnt_gap = u16_tmr_cnt_base - u16_tmr_cnt_gap;
                }
#if 1
                /* タイマ値 -> %変換 */
                u32_calc_buff = func_ud_g_calcmul_2x2_byte( u16_tmr_cnt_gap, (u16)RC_CH_DUTY_100P );
                u32_calc_buff = func_ud_g_calcdiv_4x4_byte( u32_calc_buff, (u32)u16_tmr_cnt_base );
                u8_rc_g_ch_duty_tbl[ u8_loopcnt ] = (u8)u32_calc_buff;
#else
                /* タイマ値 -> %変換 */
                /* こっちのほうが重い */
                u32_calc_buff = func_ud_g_calcdiv_4x4_byte( RC_DUTY_100P_CNT, RC_CH_DUTY_100P );
                u32_calc_buff = func_ud_g_calcdiv_4x4_byte( (u32)u16_pulse_on_time_cnt_buff, u32_calc_buff );
                u8_rc_g_ch_duty_tbl[ u8_loopcnt ] = (u8)u32_calc_buff;
#endif
            }
        }
        u8_rc_s_duty_get_complete = SET;
    }
}

/**************************************************************/
/*  Function:                                                 */
/*  パルス幅取得の動作確認                                      */
/**************************************************************/
static void func_rc_s_debug_pulseout( void )
{
#if 0
    if( u8_rc_s_duty_cnt_debug < U8_MAX )
    {
        u8_rc_s_duty_cnt_debug++;
    }

    if( u8_rc_s_duty_cnt_debug >= u8_rc_g_ch_duty_tbl[ RC_DUTY_CH_PADDLE_SHIFT_INPUT ] )
    {
        u8_rc_s_duty_cnt_debug = (u8)0;

        if( GPIO_OUT_DEBUG == CLEAR )
        {
            GPIO_OUT_DEBUG = SET;
        }
        else
        {
            GPIO_OUT_DEBUG = CLEAR;
        }
    }
#endif
}



